---
title: Identificación de amenazas avanzadas con el Análisis de comportamiento de usuarios y entidades (UEBA) en Azure Sentinel | Microsoft Docs
description: Cree líneas de base de comportamiento para entidades (usuarios, nombres de host y direcciones IP) y úselas para detectar comportamientos anómalos e identificar amenazas persistentes avanzadas (APT) de día cero.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 08/19/2020
ms.author: yelevin
ms.openlocfilehash: d3c0ba55541baf3f31952b82a2fa357b48a5f1a9
ms.sourcegitcommit: 8ad5761333b53e85c8c4dabee40eaf497430db70
ms.translationtype: HT
ms.contentlocale: es-ES
ms.lasthandoff: 11/02/2020
ms.locfileid: "93148361"
---
# <a name="identify-advanced-threats-with-user-and-entity-behavior-analytics-ueba-in-azure-sentinel"></a>Identificación de amenazas avanzadas con el Análisis de comportamiento de usuarios y entidades (UEBA) en Azure Sentinel

> [!IMPORTANT]
>
> - Las características de UEBA y de las páginas de entidad ahora están en **disponibilidad general** en las siguientes zonas geográficas y regiones de Azure Sentinel:
>    - Zonas geográficas de Estados Unidos
>    - Región Oeste de Europa
>    - Zonas geográficas de Australia
>
> - En todas las demás regiones y zonas geográficas, estas características permanecen en **versión preliminar pública** y se proporcionan sin Acuerdo de Nivel de Servicio. Para más información, consulte [Términos de uso complementarios de las Versiones Preliminares de Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

## <a name="what-is-user-and-entity-behavior-analytics-ueba"></a>¿Qué es el Análisis de comportamiento de usuarios y entidades (UEBA)?

### <a name="the-concept"></a>Concepto

La identificación de amenazas dentro de su organización y de su posible impacto, tanto si se trata de una entidad en peligro como de un usuario interno malintencionado, siempre ha sido un proceso que requiere mucho tiempo y trabajo. Examinar las alertas, unir los puntos y buscar de manera activa, en su conjunto, obligan a invertir una gran cantidad de tiempo y esfuerzo para obtener un retorno mínimo, y la posibilidad de que las amenazas sofisticadas simplemente eludan la detección. En particular, las amenazas esquivas, como las amenazas persistentes avanzadas, dirigidas y de día cero, pueden ser las más peligrosas para su organización, lo que hace que su detección sea sumamente importante.

La funcionalidad UEBA en Azure Sentinel elimina el trabajo monótono y aburrido de las cargas de trabajo de los analistas y la incertidumbre de sus esfuerzos, y ofrece inteligencia de alta fidelidad y accionable, para que puedan centrarse en la investigación y la corrección.

A medida que Azure Sentinel recopila registros y alertas de todos sus orígenes de datos conectados, los analiza y genera perfiles de comportamiento de línea de base de las entidades de la organización (usuarios, hosts, direcciones IP, aplicaciones, etc.) a lo largo del tiempo y del horizonte del grupo de homólogos. A través de diversas técnicas y funcionalidades de aprendizaje automático, Sentinel puede identificar actividades anómalas y ayudarle a determinar si un recurso se ha puesto en peligro. No solo eso, sino que también puede averiguar la sensibilidad relativa de los recursos concretos, identificar los grupos de homólogos y evaluar el impacto potencial de cualquier recurso en peligro determinado (su "radio de la explosión"). Gracias a esta información, puede priorizar la investigación y el tratamiento de incidentes de manera eficaz. 

### <a name="architecture-overview"></a>Información general sobre la arquitectura

:::image type="content" source="media/identify-threats-with-entity-behavior-analytics/entity-behavior-analytics-architecture.png" alt-text="Arquitectura de análisis de comportamiento de entidades":::

### <a name="security-driven-analytics"></a>Análisis controlado por seguridad

Basado en el paradigma de Gartner para las soluciones UEBA, Azure Sentinel proporciona un enfoque "outside-in", que se basa en tres marcos de referencia:

- **Casos de uso:** al priorizar los escenarios y vectores de ataque pertinentes según la investigación de seguridad, alineada con el marco de tácticas, técnicas y subtécnicas de MITRE ATT&CK, que coloca varias entidades como víctimas, autores o puntos de pivote en la cadena de eliminación; Azure Sentinel se centra específicamente en los registros más valiosos que puede proporcionar cada origen de datos.

- **Orígenes de datos:** Si bien ante todo se admiten orígenes de datos de Azure, Azure Sentinel selecciona cuidadosamente los orígenes de datos de terceros para proporcionar datos que coincidan con nuestros escenarios de amenazas.

- **Análisis:** a través de varios algoritmos de aprendizaje automático (ML), Azure Sentinel identifica las actividades anómalas y presenta las pruebas de manera clara y concisa en forma de enriquecimientos contextuales, algunos ejemplos de los cuales aparecen a continuación.

    :::image type="content" source="media/identify-threats-with-entity-behavior-analytics/behavior-analytics-top-down.png" alt-text="Enfoque &quot;outside-in&quot; para el análisis del comportamiento":::

Azure Sentinel presenta artefactos que ayudan a los analistas de seguridad a comprender claramente las actividades anómalas en su contexto y en comparación con el perfil de línea base del usuario. Las acciones realizadas por un usuario (o un host o una dirección) se evalúan en contexto, donde un resultado "verdadero" indica una anomalía identificada:
- entre ubicaciones geográficas, dispositivos y entornos;
- entre los horizontes de tiempo y frecuencia (en comparación con el propio historial del usuario);
- en comparación con el comportamiento de homólogos;
- en comparación con el comportamiento de la organización.

    :::image type="content" source="media/identify-threats-with-entity-behavior-analytics/context.png" alt-text="Contexto de la entidad":::


### <a name="scoring"></a>Puntuaciones

Cada actividad se puntúa con una "puntuación de prioridad de la investigación", que determina la probabilidad de que un usuario específico realice una actividad específica, en función del aprendizaje del comportamiento del usuario y de sus homólogos. Las actividades identificadas como las más anómalas reciben las puntuaciones más altas (en una escala del 0 al 10).

Consulte cómo se usa el análisis de comportamiento en [Microsoft Cloud App Security](https://techcommunity.microsoft.com/t5/microsoft-security-and/prioritize-user-investigations-in-cloud-app-security/ba-p/700136) para ver un ejemplo de cómo funciona.

## <a name="entities-in-azure-sentinel"></a>Entidades en Azure Sentinel

### <a name="entity-identifiers"></a>Identificadores de entidad

Cuando se envían alertas a Azure Sentinel, incluyen elementos de datos que Azure Sentinel identifica y clasifica como entidades, como las cuentas de usuario, los hosts y las direcciones IP, entre otras. En ocasiones, esta identificación supone un reto si la alerta no contiene información suficiente sobre la entidad.

Por ejemplo, las cuentas de usuario se pueden identificar de varias maneras: mediante el identificador único (GUID) de una cuenta de Azure AD o el valor de su nombre principal de usuario (UPN), o bien, mediante una combinación del nombre de usuario y el nombre de dominio NT. Distintos orígenes de datos pueden identificar al mismo usuario de maneras diferentes. Por lo tanto, siempre que sea posible, Azure Sentinel combina esos identificadores en una sola entidad para que se pueda identificar correctamente.

Sin embargo, puede suceder que uno de los proveedores de recursos cree una alerta en la que una entidad no esté lo suficientemente identificada (por ejemplo, un nombre de usuario sin contexto de nombre de dominio). En este caso, la entidad de usuario no se puede combinar con otras instancias de la misma cuenta de usuario, que se identificaría como entidad independiente, y esas dos entidades permanecerían independientes en lugar de unificarse.

Con el fin de minimizar el riesgo de que esto suceda, debe comprobar que todos los proveedores de alertas identifican correctamente las entidades en las alertas que producen. Además, la sincronización de entidades de cuenta de usuario con Azure Active Directory puede crear un directorio unificador que podrá combinar entidades de cuenta de usuario.

En Azure Sentinel se identifican actualmente los siguientes tipos de entidades:

- Cuenta de usuario (Account)
- Host
- Dirección IP (IP)
- Malware
- Archivo
- Proceso
- Aplicación en la nube (CloudApplication)
- Nombre de dominio (DNS)
- Recurso de Azure
- Archivo (FileHash)
- Clave del Registro
- Valor del Registro
- Grupo de seguridad
- Dirección URL
- Dispositivo IoT
- Mailbox
- Clúster de correo
- Mensaje de correo
- Correo de envío

### <a name="entity-pages"></a>Páginas de entidad

Cuando se encuentra cualquier entidad (actualmente limitada a usuarios y hosts) en una búsqueda, una alerta o una investigación, puede seleccionar la entidad y llevarla a una **página de entidad** , una hoja de datos llena de información útil sobre esa entidad. Entre los tipos de información que encontrará en esta página se incluyen datos básicos sobre la entidad, una escala de tiempo de eventos importantes relacionados con esta entidad y conclusiones sobre el comportamiento de la entidad.
 
Las páginas de entidad constan de tres partes:
- El panel de la izquierda contiene la información de identificación de la entidad, recopilada de los orígenes de datos, como Azure Active Directory, Azure Monitor, Azure Security Center y Microsoft Defender.

- En el panel central se muestra una escala de tiempo gráfica y textual de eventos importantes relacionados con la entidad, como alertas, marcadores y actividades. Las actividades son agregaciones de eventos importantes desde Log Analytics. Los equipos de investigación de seguridad de Microsoft desarrollan las consultas que detectan esas actividades.

- En el panel derecho se muestran conclusiones de comportamiento sobre la entidad. Estas conclusiones ayudan a detectar rápidamente las anomalías y las amenazas de seguridad. Los equipos de investigación de seguridad de Microsoft desarrollan las conclusiones, que se basan en los modelos de detección de anomalías.

### <a name="the-timeline"></a>Escala de tiempo

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/entity-pages-timeline.png" alt-text="Escala de tiempo de las páginas de entidad":::

La escala de tiempo es una parte importante de la contribución de la página de entidad al análisis del comportamiento en Azure Sentinel. Presenta una historia sobre eventos relacionados con la entidad, lo que le ayuda a comprender la actividad de la entidad dentro de un período de tiempo específico.

Puede elegir el **intervalo de tiempo** entre varias opciones preestablecidas (como *últimas 24 horas* ) o establecerlo en cualquier período de tiempo definido de forma personalizada. Además, puede establecer filtros que limiten la información de la escala de tiempo a tipos específicos de eventos o alertas.

En la escala de tiempo se incluyen los siguientes tipos de elementos:

- Alertas: alertas en las que la entidad se define como **entidad asignada**. Tenga en cuenta que si su organización ha creado [alertas personalizadas mediante reglas de análisis](./tutorial-detect-threats-custom.md), debe asegurarse de que la asignación de entidades de las reglas se realice correctamente.

- Marcadores: marcadores que incluyen la entidad específica que se muestra en la página.

- Actividades: agregación de eventos importantes relacionados con la entidad. 
 
### <a name="entity-insights"></a>Conclusiones sobre la entidad
 
Las conclusiones sobre la entidad son consultas definidas por los investigadores de seguridad de Microsoft para ayudar a los analistas a investigar de manera más eficiente y eficaz. Las conclusiones se presentan como parte de la página de entidad y proporcionan información de seguridad valiosa sobre los hosts y los usuarios, en forma de gráficos y datos tabulares. Disponer aquí de la información significa que no tiene que desplazarse a Log Analytics. Las conclusiones incluyen datos sobre inicios de sesión, adiciones a grupos, eventos anómalos, etc., e incluyen algoritmos avanzados de aprendizaje automático para detectar comportamientos anómalos. Las conclusiones se basan en los siguientes tipos de datos:
- syslog
- SecurityEvent
- Registros de auditoría
- Registros de inicio de sesión
- Actividad de Office
- BehaviorAnalytics (UEBA) 
 
### <a name="how-to-use-entity-pages"></a>Cómo usar páginas de entidad

Las páginas de entidad están diseñadas para formar parte de varios escenarios de uso y se puede acceder a ellas desde la administración de incidentes, el gráfico de investigación, los marcadores o directamente desde la página de búsqueda de entidades en **Análisis de comportamiento de entidades** en el menú principal de Azure Sentinel.

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/entity-pages-use-cases.png" alt-text="Casos de uso de páginas de entidad":::


## <a name="data-schema"></a>Esquema de datos

### <a name="behavior-analytics-table"></a>Tabla de análisis de comportamiento

| Campo                     | Descripción                                                         |
|---------------------------|---------------------------------------------------------------------|
| TenantId                  | Número de id. único del inquilino                                      |
| SourceRecordId            | Número de id. único del evento de EBA                                   |
| TimeGenerated             | Marca de tiempo de la repetición de la actividad                              |
| TimeProcessed             | Marca de tiempo del procesamiento de la actividad por parte del motor de EBA            |
| ActivityType              | Categoría de alto nivel de la actividad                                 |
| ActionType                | Nombre normalizado de la actividad                                     |
| UserName                  | Nombre de usuario del usuario que inició la actividad                    |
| UserPrincipalName         | Nombre de usuario completo del usuario que inició la actividad               |
| EventSource               | Origen de datos que proporcionó el evento original                        |
| SourceIPAddress           | Dirección IP desde la que se inició la actividad                        |
| SourceIPLocation          | País desde el que se inició la actividad, enriquecido a partir de la dirección IP |
| SourceDevice              | Nombre de host del dispositivo que inició la actividad                  |
| DestinationIPAddress      | Dirección IP del destino de la actividad                            |
| DestinationIPLocation     | País del destino de la actividad, enriquecido a partir de la dirección IP     |
| DestinationDevice         | Nombre del dispositivo de destino                                           |
| **UsersInsights**         | Enriquecimientos contextuales de usuarios implicados                            |
| **DevicesInsights**       | Enriquecimientos contextuales de dispositivos implicados                          |
| **ActivityInsights**      | Análisis contextual de la actividad basada en la generación de perfiles              |
| **InvestigationPriority** | Puntuación de anomalías, entre 0 y 10 (0=benigno, 10=muy anómalo)         |
|

### <a name="querying-behavior-analytics-data"></a>Consulta de datos de análisis de comportamiento

Mediante [KQL](https://docs.microsoft.com/azure/data-explorer/kusto/query/), se puede consultar la tabla de análisis de comportamiento.

Por ejemplo, si queremos encontrar todos los casos en los que un usuario no pudo iniciar sesión en un recurso de Azure, donde era el primer intento de conexión del usuario desde un país determinado, y las conexiones desde ese país son poco frecuentes incluso para los homólogos de ese usuario, podemos usar la siguiente consulta:

```Kusto
BehaviorAnalytics
| where ActivityType == "FailedLogOn"
| where FirstTimeUserConnectedFromCountry == True
| where CountryUncommonlyConnectedFromAmongPeers == True
```

### <a name="user-peers-metadata---table-and-notebook"></a>Metadatos de homólogos del usuario: tabla y cuaderno

Los metadatos de los homólogos del usuario proporcionan un contexto importante en las detecciones de amenazas, en la investigación de un incidente y en la búsqueda de una amenaza potencial. Los analistas de seguridad pueden observar las actividades normales de los homólogos del usuario para determinar si las actividades del usuario son inusuales en comparación con las de sus homólogos.

Azure Sentinel calcula y clasifica los homólogos de un usuario en función de la pertenencia a grupos de seguridad de Azure AD del usuario, la lista de distribución de correo, etc., y almacena los homólogos clasificados de 1 a 20 en la tabla **UserPeerAnalytics**. En la captura de pantalla siguiente se muestra el esquema de la tabla UserPeerAnalytics, y se muestran los ocho homólogos mejor clasificados del usuario Kendall Collins. Azure Sentinel usa el algoritmo *TF-IDF* ( frecuencia de término – frecuencia inversa de documento) para normalizar la ponderación para calcular la clasificación: cuanto menor sea el grupo, mayor será la ponderación. 

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/user-peers-metadata.png" alt-text="Captura de pantalla de la tabla de metadatos de homólogos del usuario":::

Puede usar el cuaderno de [Jupyter Notebook](https://github.com/Azure/Azure-Sentinel-Notebooks/tree/master/BehaviorAnalytics/UserSecurityMetadata) proporcionado en el repositorio de GitHub de Azure Sentinel para visualizar los metadatos de los homólogos del usuario. Para obtener instrucciones detalladas sobre cómo usar el cuaderno, consulte el cuaderno [Análisis guiado: metadatos de seguridad de usuario](https://github.com/Azure/Azure-Sentinel-Notebooks/blob/master/BehaviorAnalytics/UserSecurityMetadata/Guided%20Analysis%20-%20User%20Security%20Metadata.ipynb).

### <a name="permission-analytics---table-and-notebook"></a>Análisis de permisos: tabla y cuaderno

El análisis de permisos ayuda a determinar el impacto potencial de que un atacante ponga en peligro un recurso de la organización. Este impacto también se conoce como "radio de explosión" del recurso. Los analistas de seguridad pueden usar esta información para clasificar las investigaciones y el control de incidentes.

Azure Sentinel determina los derechos de acceso directo y transitivo que mantiene un usuario determinado en los recursos de Azure, mediante la evaluación de las suscripciones de Azure a las que el usuario puede tener acceso directamente o a través de grupos o entidades de servicio. Esta información, así como la lista completa de la pertenencia a grupos de seguridad Azure AD del usuario, se almacena en la tabla **UserAccessAnalytics**. En la captura de pantalla siguiente se muestra una fila de ejemplo de la tabla UserAccessAnalytics para el usuario Alex Johnson. La **entidad de origen** es la cuenta de usuario o de entidad de servicio, y la **entidad de destino** es el recurso al que tiene acceso la entidad de origen. Los valores de **nivel de acceso** y **tipo de acceso** dependen del modelo de control de acceso de la entidad de destino. Puede ver que Alex tiene acceso de colaborador a la suscripción de Azure *Contoso Hotels Tenant*. El modelo de control de acceso de la suscripción es RBAC.   

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/user-access-analytics.png" alt-text="Captura de pantalla de la tabla de análisis de acceso de usuario":::

Puede usar el cuaderno de [Jupyter Notebook](https://github.com/Azure/Azure-Sentinel-Notebooks/tree/master/BehaviorAnalytics/UserSecurityMetadata) (el mismo cuaderno mencionado anteriormente) del repositorio de GitHub de Azure Sentinel para visualizar los datos de análisis de permisos. Para obtener instrucciones detalladas sobre cómo usar el cuaderno, consulte el cuaderno [Análisis guiado: metadatos de seguridad de usuario](https://github.com/Azure/Azure-Sentinel-Notebooks/blob/master/BehaviorAnalytics/UserSecurityMetadata/Guided%20Analysis%20-%20User%20Security%20Metadata.ipynb).

### <a name="hunting-queries-and-exploration-queries"></a>Consultas de búsqueda y consultas de exploración

Azure Sentinel proporciona de serie un conjunto de consultas de búsqueda, consultas de exploración y un libro, en función de la tabla BehaviorAnalytics. Estas herramientas presentan datos enriquecidos, centrados en casos de uso específicos, que indican un comportamiento anómalo. 

Obtenga más información sobre [la búsqueda y el gráfico de investigación](./hunting.md) en Azure Sentinel.

## <a name="next-steps"></a>Pasos siguientes
En este documento, ha aprendido acerca de las funcionalidades de análisis de comportamiento de entidades de Azure Sentinel. Para obtener instrucciones prácticas sobre la implementación y para usar las conclusiones obtenidas, consulte los siguientes artículos:

- [Habilitación del análisis de comportamiento de entidades](./enable-entity-behavior-analytics.md) en Azure Sentinel
- [Búsqueda de amenazas de seguridad](./hunting.md)